[
  {
    "id": 1,
    "title": "terminus",
    "images": [
      "./img/terminus/terminus_1.png",
      "./img/terminus/terminus_2.jpg",
      "./img/terminus/terminus_3.jpg",
      "./img/terminus/terminus_4.jpg",
      "./img/terminus/terminus_5.jpg",
      "./img/terminus/terminus_6.jpg"
    ],
    "link": "projet.html?proj-id=1",
    "description": "Terminus est un court-métrage filmé entièrement avec des lentilles macro. Nous devions faire un film macro d'environ deux minutes avec carte blanche pour le theme. Le film montre les conséquences dramatiques de la conduite sous l' emprise de l' alcool. Grâce à la macrophotographie, chaque image devient intense et intriguante. On ressent qu'à tous moments, tout peut mal se passer. Terminus veut faire réfléchir sur la responsabilité et montrer à quel point un simple geste peut tout changer. ",
    "logiciels": [
      "./img/logiciels/davinci.png",
      "./img/logiciels/reaper.png"
    ],
    "roles": [
      "directeur lumière",
      "directeur photo",
      "acteur",
      "cadreuse"
    ],
    "collaborateurs": [
      "Alexandre Gendron",
      "Mikael Arseneau",
      "Justin Montpetit",
      "Sandrine Jean"
    ],
    "video": "https://www.youtube.com/embed/r0QNP7BkuOE?si=mcvAb3OuA2FqHqFR",
    "role": "réalisateur",
    "cours": "vidéo 2",
    "type": "en équipe",
    "phrase": "Terminus est un court-métrage en macrophotographie qui illustre de façon symbolique et intense les conséquences tragiques de la conduite en état d'ivresse."
  },
  {
    "id": 2,
    "title": "chasseur de crânes",
    "images": [
      "./img/chasseur_de_cranes/chasseur_1.jpg",
      "./img/chasseur_de_cranes/chasseur_2.jpg",
      "./img/chasseur_de_cranes/chasseur_3.jpg",
      "./img/chasseur_de_cranes/chasseur_4.jpg",
      "./img/chasseur_de_cranes/chasseur_5.jpg",
      "./img/chasseur_de_cranes/chasseur_6.jpg"
    ],
    "link": "projet.html?proj-id=2",
    "description": "Chasseur de Crânes est un jeu en réalité virtuelle qui à la base devait être une modernisation VR d'un jeu rétro. Au final, nous avons fait ceci. Le joueur incarne un chevalier explorant un donjon sombre rempli de crânes enflammés déterminés à le vaincre. Son but est de survivre et d'éliminer le boss final pour terminer le jeu. Un deuxième joueur peut intervenir en ajustant la lumière des torches et la vitesse des crânes, rendant la partie plus difficile. Cette mécanique crée une interaction dynamique entre les deux joueurs et ajoute une tension à chaque partie.",
    "logiciels": [
      "./img/logiciels/unity.png",
      "./img/logiciels/vs.png",
      "./img/logiciels/touch.png"
    ],
    "roles": [
      "modélisateur",
      "level design"
    ],
    "collaborateurs": [
      "Alexandre Gendron",
      "Mikael Arseneau"
    ],
    "processus": "Pour Chasseur de Crânes, l'idée nous est venue de faire un jeu de chevalier, car nous voulions créer un jeu dans le même style que Duck Hunt. Finalement, nous avons opté pour un jeu d'épée par simplicité. Nous avons rencontré plusieurs problèmes dans la scène Unity, et certains de nos scripts se sont mélangés, ce qui a causé beaucoup de bugs. Au départ, nous voulions que les crânes crachent des boules de feu, mais nous avons abandonné cette idée par manque de temps et pour simplifier le développement. Au final, je crois que nous avons réussi à faire un bon jeu malgré tous les raccourcis que nous avons pris.",
    "video": "https://www.youtube.com/embed/4QJ_51Vos0Q?si=ZqX3hF26_5ImH_1F",
    "role": "programmeur",
    "cours": "réalité mixte",
    "type": "en équipe",
    "phrase": "Chasseur de Crânes est un jeu en réalité virtuelle où un chevalier affronte des crânes volants dans un donjon, tandis qu'un second joueur influence sa survie en contrôlant la lumière et la difficulté du jeu.",
    "images_processus": [
      "./img/processus/MapProjetVr.png",
      "./img/processus/moodboard_ennemi.jpg",
      "./img/processus/moodboard_environnement.png",
      "./img/processus/moodboard_epee.jpg"
    ]
  },
  {
    "id": 3,
    "title": "fou de vitesse",
    "images": [
      "./img/fou_de_vitesse/fou_3.png",
      "./img/fou_de_vitesse/fou_4.png",
      "./img/fou_de_vitesse/fou_1.png",
      "./img/fou_de_vitesse/fou_5.png",
      "./img/fou_de_vitesse/fou_6.png",
      "./img/fou_de_vitesse/fou_7.png"
    ],
    "link": "projet.html?proj-id=3",
    "description": "Fou de vitesse est un jeu de course multijoueur en 2D créé avec Phaser, inspiré des jeux rétro en vue de dessus. Je devais créer un jeu 2D avec Phaser et j'ai créé ce jeu. Jusqu'à trois joueurs s'affrontent sur un circuit rapide et coloré, où ils doivent compléter trois tours le plus vite possible tout en ramassant un maximum de pièces. Le joueur qui fait le meilleur temps et collecte le plus de pièces remporte la partie. Ce projet propose une expérience dynamique, compétitive et accessible à tous.",
    "logiciels": [
      "./img/logiciels/vscode.png",
      "./img/logiciels/figma.png",
      "./img/logiciels/js.png"
    ],
    "video": "https://itch.io/embed/3166710",
    "role": "programmeur",
    "cours": "intéractivité ludique",
    "type": "solo",
    "phrase": "Fou de vitesse est un jeu de course rétro en vue de dessus où jusqu'à trois joueurs s'affrontent pour réaliser le meilleur temps et récolter le plus de pièces sur un circuit pixellisé."
  },
  {
    "id": 4,
    "title": "prisonnier de soi-même",
    "images": [
      "./img/3d/3d_3.jpg",
      "./img/3d/3d_2.jpg",
      "./img/3d/3d_1.jpg",
      "./img/3d/3d_4.jpg",
      "./img/3d/3d_5.jpg",
      "./img/3d/3d_6.jpg"
    ],
    "link": "projet.html?proj-id=4",
    "description": "Prisonnier de soi-même est un court-métrage d'animation 3D, réalisé à partir de modèles et de décors que j'ai créés et pris en ligne, puis animés à l'aide de mouvements trouvés sur le web. Le montage final a été réalisé dans DaVinci Resolve. Le film raconte l'histoire d'une personne plongée dans le coma, prisonnière de ses pensées et de ses peurs. Au travers d'un espace vague pour représenter l'esprit, il montre la confusion, la solitude et la lutte intérieure pour retrouver le contrôle ou s'échapper de son propre esprit.",
    "logiciels": [
      "./img/logiciels/maya.png",
      "./img/logiciels/davinci.png",
      "./img/logiciels/reaper.png"
    ],
    "video": "https://www.youtube.com/embed/vqFKLkE7WQo?si=tLFGkQz_9TzN1NkW",
    "role": "animateur",
    "cours": "animation 3D",
    "type": "solo",
    "phrase": "Prisonnier de soi-même est un court-métrage d'animation 3D qui explore le combat intérieur d'une personne plongée dans le coma, prisonnière de ses pensées et de sa propre conscience."
  },
  {
    "id": 5,
    "title": "paysage",
    "images": [
      "./img/paysage/paysage intro.jpg",
      "./img/paysage/paysage_2.jpg",
      "./img/paysage/paysage_3.jpg",
      "./img/paysage/paysage_4.jpg",
      "./img/paysage/paysage_5.jpg",
      "./img/paysage/paysage_6.jpg"
    ],
    "link": "projet.html?proj-id=5",
    "description": "Paysage est un projet multimédia interactif réalisé avec TouchDesigner, combinant vidéo, animation 3D et un paysage audio créé sur Max. J'ai créé plusieurs scènes visuelles intégrant mes propres effets et animations, tandis que la partie sonore a été conçue sur Max et Reaper. Le tout est contrôlé à l'aide de claviers MIDI Nanokontrol, permettant à l'utilisateur d'influencer en temps réel l'environnement visuel et sonore. Inspiré de mon court-métrage Prisonnier de soi-même, Paysage propose une expérience immersive et évolutive où chaque action façonne un monde sensoriel unique.",
    "logiciels": [
      "./img/logiciels/maya.png",
      "./img/logiciels/touch.png",
      "./img/logiciels/max.png"
    ],
    "video": "https://www.youtube.com/embed/1Sibb4UsMqE?si=hBxtTHZyt-QhlSwo",
    "role": "créateur",
    "cours": "traitement audiovisuel & audio 2",
    "type": "solo",
    "phrase": "Paysage est un projet multimédia interactif où sons et images réagissent aux gestes, à la voix et aux claviers MIDI, offrant une expérience immersive et évolutive inspirée de l'univers visuel de Prisonnier de soi-même."
  }
]